## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 14 to add, 10 to change, 26 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| recreate | `aws_lambda_function.audit_logs`                                                  |
|          | `aws_lambda_function.audit_logs_archiver`                                         |
|          | `aws_lambda_function.form_archiver`                                               |
|          | `aws_lambda_function.nagware`                                                     |
|          | `aws_lambda_function.reliability`                                                 |
|          | `aws_lambda_function.reliability_dlq_consumer`                                    |
|          | `aws_lambda_function.response_archiver`                                           |
|          | `aws_lambda_function.submission`                                                  |
|          | `aws_lambda_function.vault_integrity`                                             |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
|          | `aws_lambda_permission.audit_logs_archiver`                                       |
| delete   | `aws_lambda_code_signing_config.lambda_code_signing_config[0]`                    |
|          | `aws_s3_object.audit_logs_archiver_code`                                          |
|          | `aws_s3_object.audit_logs_code`                                                   |
|          | `aws_s3_object.form_archiver_code`                                                |
|          | `aws_s3_object.nagware_code`                                                      |
|          | `aws_s3_object.reliability_code`                                                  |
|          | `aws_s3_object.reliability_dlq_consumer_code`                                     |
|          | `aws_s3_object.response_archiver_code`                                            |
|          | `aws_s3_object.submission_code`                                                   |
|          | `aws_s3_object.vault_integrity_code`                                              |
|          | `aws_signer_signing_job.vault_integrity[0]`                                       |
|          | `aws_signer_signing_profile.lambda_signing_profile[0]`                            |
| update   | `aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger`                  |
|          | `aws_cloudwatch_event_target.form_archiver_lambda_trigger`                        |
|          | `aws_cloudwatch_event_target.nagware_lambda_trigger`                              |
|          | `aws_cloudwatch_event_target.reliability_dlq_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.response_archiver_lambda_trigger`                    |
|          | `aws_iam_policy.lambda_s3`                                                        |
|          | `aws_lambda_event_source_mapping.audit_logs`                                      |
|          | `aws_lambda_event_source_mapping.reliability`                                     |
|          | `aws_lambda_event_source_mapping.reprocess_submission`                            |
|          | `aws_lambda_event_source_mapping.vault_updated_item_stream`                       |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/9132687170).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "audit_logs_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs_Archiver" -> (known after apply)
        id             = "audit-logs-archiver-lambda-trigger-terraform-20240227164709957300000001"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.form_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "form_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Archive_Form_Templates" -> (known after apply)
        id             = "form-archiver-lambda-trigger-terraform-20240213151144091000000003"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.nagware_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "nagware_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Nagware" -> (known after apply)
        id             = "nagware-lambda-trigger-terraform-20240213151155623500000004"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.reliability_dlq_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "reliability_dlq_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability_DLQ_Consumer" -> (known after apply)
        id             = "reliability-dlq-lambda-trigger-terraform-20240213151144080500000001"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.response_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "response_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Response_Archiver" -> (known after apply)
        id             = "response-archiver-lambda-trigger-terraform-20240213151144087800000002"
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id          = "arn:aws:iam::957818836222:policy/lambda_s3"
        name        = "lambda_s3"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:s3:::forms-production-reliability-file-storage",
                          - "arn:aws:s3:::forms-production-lambda-code/*",
                          - "arn:aws:s3:::forms-production-lambda-code",
                            "arn:aws:s3:::forms-production-audit-logs-archive-storage/*",
                            # (3 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_code_signing_config.lambda_code_signing_config[0] will be destroyed
  # (because aws_lambda_code_signing_config.lambda_code_signing_config is not in configuration)
  - resource "aws_lambda_code_signing_config" "lambda_code_signing_config" {
      - arn           = "arn:aws:lambda:ca-central-1:957818836222:code-signing-config:csc-0ea61cbb9c887afee" -> null
      - config_id     = "csc-0ea61cbb9c887afee" -> null
      - id            = "arn:aws:lambda:ca-central-1:957818836222:code-signing-config:csc-0ea61cbb9c887afee" -> null
      - last_modified = "2024-01-25T16:10:17.108835Z" -> null

      - allowed_publishers {
          - signing_profile_version_arns = [
              - "arn:aws:signer:ca-central-1:957818836222:/signing-profiles/lambda_signing_profile_20240125160945309900000001/qlihrOkB2U",
            ] -> null
        }

      - policies {
          - untrusted_artifact_on_deployment = "Enforce" -> null
        }
    }

  # aws_lambda_event_source_mapping.audit_logs will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "audit_logs" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs" -> (known after apply)
        id                                 = "46934244-6fab-43a6-9280-8c8309c0d6b8"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.reliability will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "reliability" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability" -> (known after apply)
        id                                 = "2f994c5c-aeea-4d98-a56a-cd857e06ac89"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.reprocess_submission will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability" -> (known after apply)
        id                                 = "da835a8c-6843-42f8-8509-6955dab673f1"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:957818836222:function:Vault_Data_Integrity_Check" -> (known after apply)
        id                                 = "8ea9dcb0-b362-47a1-8174-88f364ff034a"
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs must be replaced
-/+ resource "aws_lambda_function" "audit_logs" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs" -> (known after apply)
      ~ function_name                  = "Audit_Logs" -> "audit-logs" # forces replacement
      - handler                        = "audit_logs.handler" -> null
      ~ id                             = "Audit_Logs" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-19T14:40:47.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "audit_logs_code" -> null
      - s3_object_version              = "f_BzlZGp3EIHK9A_wAhInHPwzcXp2YLb" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> (known after apply)
      ~ source_code_size               = 4114773 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver must be replaced
-/+ resource "aws_lambda_function" "audit_logs_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs_Archiver" -> (known after apply)
      ~ function_name                  = "Audit_Logs_Archiver" -> "audit-logs-archiver" # forces replacement
      - handler                        = "audit_logs_archiver.handler" -> null
      ~ id                             = "Audit_Logs_Archiver" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs_Archiver/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-27T16:47:10.032+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs_Archiver:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Audit_Logs_Archiver:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "audit_logs_archiver_code" -> null
      - s3_object_version              = "DhF3gQ_URRoNmSMI2xUH2ZMEKTiFYs8d" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> (known after apply)
      ~ source_code_size               = 4774980 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver must be replaced
-/+ resource "aws_lambda_function" "form_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Archive_Form_Templates" -> (known after apply)
      ~ function_name                  = "Archive_Form_Templates" -> "form-archiver" # forces replacement
      - handler                        = "form_archiver.handler" -> null
      ~ id                             = "Archive_Form_Templates" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Archive_Form_Templates/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-16T14:11:54.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Archive_Form_Templates:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Archive_Form_Templates:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "form_archiver_code" -> null
      - s3_object_version              = "OXu4Z6SwziptV7LIM00eSMf_PIkNEqik" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> (known after apply)
      ~ source_code_size               = 4485536 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware must be replaced
-/+ resource "aws_lambda_function" "nagware" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Nagware" -> (known after apply)
      ~ function_name                  = "Nagware" -> "nagware" # forces replacement
      - handler                        = "nagware.handler" -> null
      ~ id                             = "Nagware" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Nagware/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-16T14:11:49.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Nagware:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Nagware:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "nagware_code" -> null
      - s3_object_version              = "8IGUIN3KdmHILOgdapJHBBoyjC6WHrhZ" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> (known after apply)
      ~ source_code_size               = 10578943 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability must be replaced
-/+ resource "aws_lambda_function" "reliability" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability" -> (known after apply)
      ~ function_name                  = "Reliability" -> "reliability" # forces replacement
      - handler                        = "reliability.handler" -> null
      ~ id                             = "Reliability" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Reliability/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-23T14:47:55.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Reliability:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "reliability_code" -> null
      - s3_object_version              = "z3oy_T8ai487X.40NWODpN1ewcjAymmN" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> (known after apply)
      ~ source_code_size               = 11933697 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer must be replaced
-/+ resource "aws_lambda_function" "reliability_dlq_consumer" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability_DLQ_Consumer" -> (known after apply)
      ~ function_name                  = "Reliability_DLQ_Consumer" -> "reliability-dlq-consumer" # forces replacement
      - handler                        = "dead_letter_queue_consumer.handler" -> null
      ~ id                             = "Reliability_DLQ_Consumer" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Reliability_DLQ_Consumer/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-13T15:11:44.105+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Reliability_DLQ_Consumer:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Reliability_DLQ_Consumer:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "reliability_dlq_consumer_code" -> null
      - s3_object_version              = "2eQTRAlARSviv5DKxSJvaPNpvg0ZmKwm" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> (known after apply)
      ~ source_code_size               = 4641394 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver must be replaced
-/+ resource "aws_lambda_function" "response_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Response_Archiver" -> (known after apply)
      ~ function_name                  = "Response_Archiver" -> "response-archiver" # forces replacement
      - handler                        = "response_archiver.handler" -> null
      ~ id                             = "Response_Archiver" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Response_Archiver/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-13T15:11:44.124+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Response_Archiver:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Response_Archiver:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "response_archiver_code" -> null
      - s3_object_version              = "Qo0cmKhunoREYbSMy1NrRUGXqm20PLeB" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> (known after apply)
      ~ source_code_size               = 5847434 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission must be replaced
-/+ resource "aws_lambda_function" "submission" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Submission" -> (known after apply)
      - handler                        = "submission.handler" -> null
      ~ id                             = "Submission" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Submission/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-19T14:40:49.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Submission:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Submission:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "submission_code" -> null
      - s3_object_version              = "Ki9.vSqhDu3OCBabYVJPzhbPTfYOlE1T" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8=" -> (known after apply)
      ~ source_code_size               = 5435903 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity must be replaced
-/+ resource "aws_lambda_function" "vault_integrity" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Vault_Data_Integrity_Check" -> (known after apply)
      - code_signing_config_arn        = "arn:aws:lambda:ca-central-1:957818836222:code-signing-config:csc-0ea61cbb9c887afee" -> null
      ~ function_name                  = "Vault_Data_Integrity_Check" -> "vault-integrity" # forces replacement
      - handler                        = "vault_data_integrity_check.handler" -> null
      ~ id                             = "Vault_Data_Integrity_Check" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Vault_Data_Integrity_Check/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-30T18:40:25.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Vault_Data_Integrity_Check:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Vault_Data_Integrity_Check:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-production-lambda-code" -> null
      - s3_key                         = "signed/9379790a-421e-415a-9c93-647db5900668" -> null
      ~ signing_job_arn                = "arn:aws:signer:ca-central-1:957818836222:/signing-jobs/9379790a-421e-415a-9c93-647db5900668" -> (known after apply)
      ~ signing_profile_version_arn    = "arn:aws:signer:ca-central-1:957818836222:/signing-profiles/lambda_signing_profile_20240125160945309900000001/qlihrOkB2U" -> (known after apply)
      ~ source_code_hash               = "9lDCUtEgnDGaN0b7aU2yhDlM0DDumsUYZhbUsYDuAF4=" -> (known after apply)
      ~ source_code_size               = 8238441 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - environment {
          - variables = {
              - "LOCALSTACK" = "false"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_archive_form_responses_lambda" {
      ~ function_name       = "Response_Archiver" -> "response-archiver" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda" {
      ~ function_name       = "Reliability_DLQ_Consumer" -> "reliability-dlq-consumer" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_form_archiver_lambda" {
      ~ function_name       = "Archive_Form_Templates" -> "form-archiver" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_nagware_lambda" {
      ~ function_name       = "Nagware" -> "nagware" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.audit_logs_archiver must be replaced
-/+ resource "aws_lambda_permission" "audit_logs_archiver" {
      ~ function_name       = "Audit_Logs_Archiver" -> "audit-logs-archiver" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.audit_logs_archiver_code will be destroyed
  # (because aws_s3_object.audit_logs_archiver_code is not in configuration)
  - resource "aws_s3_object" "audit_logs_archiver_code" {
      - bucket                 = "forms-production-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag               ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
